syntax on
filetype indent on

set number
set encoding=utf8
set fileformat=unix


set nowrap



"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 折叠
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
set fdm=marker

"set smartindent "基于autoindent的一些改进
"set cindent

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
" 搜索
"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
set hlsearch "高亮搜索结果
